backend/app/controllers/api/v1/enterprises_controller.rb

SELECT "enterprises".* FROM "enterprises"
---
  def index
    @enterprises = Enterprise.all

INSERT INTO "enterprises" ("name", "is_like", "id_enterprise", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Condomínio Life Park Apto AP0011GITF"], ["is_like", 1], ["id_enterprise", 17922], ["created_at", "2021-01-24 21:39:42.697529"], ["updated_at", "2021-01-24 21:39:42.697529"]]
---
  def create
    @enterprise = Enterprise.new(enterprise_params)

    if @enterprise.save

UPDATE "enterprises" SET "is_like" = ?, "updated_at" = ? WHERE "enterprises"."id" = ?  [["is_like", 0], ["updated_at", "2021-01-24 21:58:29.557921"], ["id", 2]]
---
  def update
    if @enterprise.update(enterprise_params)

SELECT "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_enterprise
      @enterprise = Enterprise.find(params[:id])